fix: move @ton/core @ton/ton @ton/crypto to peerDependencies
